# Datos de titanic

In [2]:
import seaborn as sns

In [3]:
titanic = sns.load_dataset("titanic")

In [6]:
titanic.head()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True

In [7]:
import numpy as np
import pandas as pd

In [8]:
titanic['survived'] = pd.Categorical(titanic['survived'])

In [9]:
titanic['pclass'] = pd.Categorical(titanic['pclass'])

In [13]:
titanic['sex'] = pd.Categorical(titanic['sex'])

In [16]:
titanic['deck'] = pd.Categorical(titanic['deck'])

## Tablas de contingencia de una variable

In [10]:
tab = pd.crosstab(index = titanic['survived'],
                 columns = 'pasajeros')

In [11]:
tab

col_0     pasajeros
survived
0               549
1               342

In [12]:
pd.crosstab(index = titanic['pclass'],
           columns = "pasajeros")

col_0   pasajeros
pclass
1             216
2             184
3             491

In [29]:
tab_sex = pd.crosstab(index = titanic['sex'],
           columns = "pasajeros")

In [23]:
tab_c = pd.crosstab(index = titanic['deck'],
           columns = "count")
tab_c

col_0  count
deck
A         15
B         47
C         59
D         33
E         32
F         13
G          4

In [24]:
tab_c.sum()

col_0
count    203
dtype: int64

In [26]:
tab_c.shape

(7, 1)

In [27]:
tab_c.iloc[1:5]

col_0  count
deck
B         47
C         59
D         33
E         32

In [28]:
tab_c/tab_c.sum()

col_0     count
deck
A      0.073892
B      0.231527
C      0.290640
D      0.162562
E      0.157635
F      0.064039
G      0.019704

In [32]:
tab_sex/tab_sex.sum()

col_0   pasajeros
sex
female   0.352413
male     0.647587

In [34]:
tab/tab.sum()

col_0     pasajeros
survived
0          0.616162
1          0.383838

### Tablas de contingencia para dos variables

In [37]:
survived_sex = pd.crosstab(index = titanic['survived'],
                          columns = titanic['sex'] )

survived_sex.index = ["died","survived"]
survived_sex

sex       female  male
died          81   468
survived     233   109

In [47]:
survived_pclass = pd.crosstab(index = titanic['survived'],
                             columns = titanic['pclass'],
                             margins = True)
survived_pclass.index = ["Murió","Sobrevivió", "Total_Class"]
survived_pclass.columns = ["Primera", "Segunda", "Tercera", "Total"]
survived_pclass

             Primera  Segunda  Tercera  Total
Murió             80       97      372    549
Sobrevivió       136       87      119    342
Total_Class      216      184      491    891

### Frecuencias relativas globales

In [50]:
survived_pclass/survived_pclass.loc["Total_Class","Total"]

              Primera   Segunda   Tercera     Total
Murió        0.089787  0.108866  0.417508  0.616162
Sobrevivió   0.152637  0.097643  0.133558  0.383838
Total_Class  0.242424  0.206510  0.551066  1.000000

### Frecuencias relativas marginales

In [51]:
survived_pclass/survived_pclass.loc["Total_Class"]

             Primera   Segunda   Tercera     Total
Murió        0.37037  0.527174  0.757637  0.616162
Sobrevivió   0.62963  0.472826  0.242363  0.383838
Total_Class  1.00000  1.000000  1.000000  1.000000

In [55]:
survived_pclass.T/survived_pclass["Total"]

            Murió  Sobrevivió  Total_Class
Primera  0.145719    0.397661     0.242424
Segunda  0.176685    0.254386     0.206510
Tercera  0.677596    0.347953     0.551066
Total    1.000000    1.000000     1.000000

In [57]:
survived_pclass.div(survived_pclass["Total"], axis = 0)

              Primera   Segunda   Tercera  Total
Murió        0.145719  0.176685  0.677596    1.0
Sobrevivió   0.397661  0.254386  0.347953    1.0
Total_Class  0.242424  0.206510  0.551066    1.0